config.org
#+TITLE: Emacs Config
#+AUTHOR: Adwait Adhikari
#+PROPERTY: header-args :tangle init.el
#+STARTUP: showeverything
#+OPTIONS: toc:2 ^:{}
#+auto_tangle: t

* Table of Contents :TOC:
- [[#important-initializations][Important Initializations]]
  - [[#early-init][Early Init]]
  - [[#loading-scripts--custom-file][Loading Scripts & Custom File]]
  - [[#evil-mode][Evil Mode]]
  - [[#general-keybindings][General Keybindings]]
  - [[#icons][Icons]]
  - [[#mode-line][Mode-line]]
  - [[#sane-defaults][Sane Defaults]]
  - [[#session-preservation][Session Preservation]]
  - [[#theme][Theme]]
  - [[#which-key][Which Key]]
- [[#applications][Applications]]
  - [[#avy][Avy]]
  - [[#browse-url][Browse URL]]
  - [[#buffer-alist][Buffer Alist]]
  - [[#buffer-commands][Buffer Commands]]
  - [[#buffer-terminator][Buffer Terminator]]
  - [[#calibre][Calibre]]
  - [[#expand-region][Expand Region]]
  - [[#elfeed][Elfeed]]
  - [[#eww][EWW]]
  - [[#gptel][Gptel]]
  - [[#jinx][Jinx]]
  - [[#language-tool][Language Tool]]
  - [[#mu4e][Mu4e]]
  - [[#obsidian][Obsidian]]
  - [[#pdf-tools][PDF Tools]]
  - [[#popper][Popper]]
  - [[#ultra-scroll][Ultra Scroll]]
  - [[#uniline][Uniline]]
  - [[#wombag][Wombag]]
- [[#buffer-management][Buffer Management]]
  - [[#ibuffer][Ibuffer]]
  - [[#perspective][Perspective]]
- [[#development][Development]]
  - [[#preview][Preview]]
  - [[#completions][Completions]]
  - [[#direnv][Direnv]]
  - [[#formatters][Formatters]]
  - [[#flycheck][Flycheck]]
  - [[#eglot][Eglot]]
  - [[#language-specific][Language Specific]]
  - [[#ligatures][Ligatures]]
  - [[#rainbow-delimiters][Rainbow Delimiters]]
  - [[#projectile][Projectile]]
  - [[#sops][SOPS]]
  - [[#treesitter][Treesitter]]
  - [[#yasnippets][Yasnippets]]
- [[#dired][Dired]]
  - [[#diredfl][Diredfl]]
  - [[#dirvish][Dirvish]]
  - [[#dired-open][Dired Open]]
  - [[#peep-dired][Peep Dired]]
- [[#fonts][Fonts]]
  - [[#setting-font-faces][Setting Font Faces]]
  - [[#zooming-inout][Zooming In/Out]]
- [[#git][Git]]
  - [[#diff-hl][Diff HL]]
  - [[#magit][Magit]]
- [[#helpful][Helpful]]
- [[#minibuffer-completion][Minibuffer Completion]]
  - [[#consult][Consult]]
  - [[#embark][Embark]]
  - [[#extended-settings][Extended Settings]]
  - [[#icons-1][Icons]]
  - [[#marginalia][Marginalia]]
  - [[#oderless][Oderless]]
  - [[#vertico][Vertico]]
- [[#org-mode][Org Mode]]
  - [[#custom-functions][Custom Functions]]
  - [[#better-fonts][Better Fonts]]
  - [[#settings][Settings]]
  - [[#denote][Denote]]
  - [[#org-agenda][Org Agenda]]
  - [[#org-download][Org Download]]
  - [[#org-latex][Org Latex]]
  - [[#org-protocol][Org Protocol]]
  - [[#org-superstar][Org Superstar]]
  - [[#org-todoist][Org Todoist]]
  - [[#prettify-symbols][Prettify Symbols]]
  - [[#small-utilities][Small Utilities]]
  - [[#svg-tags][SVG Tags]]
  - [[#visual-fill-column][Visual Fill Column]]
- [[#shells--terminals][Shells & Terminals]]
  - [[#eshell][Eshell]]
  - [[#vterm][Vterm]]
- [[#undo][Undo]]
  - [[#undo-fu][Undo Fu]]
  - [[#vundo][Vundo]]

* Important Initializations
